<?php
include_once('../outline/header.php')
?>

		<!-- 내용 -->
		<main id="content">
			
			<div class="sub-title">
				<h2>개인정보 취급방침</h2>
				<a class="btn-prev" href="#"><img src="../static/img/btn/btn_page_prev.png" alt="이전 페이지"></a>
			</div>
			
			<div class="agree-content-box">
				<div class="inner">
					<p>
					(주)데코앤컴퍼니는 (이하 "회사"는) 고객님의 개인정보를 중요시하며, "정보통신망 이용촉진 및 정보보호"에 관한 법률을 준수하고 있습니다. <br><br>
					회사는 개인정보취급방침을 통하여 고객님께서 제공하시는 개인정보가 어떠한 용도와 방식으로 이용되고 있으며, 개인정보보호를 위해 어떠한 조치가 취해지고 있는지 알려드립니다.
					</p>
					<h3>수집하는 개인정보 항목 및 수집방법</h3>
					<p>
						가. 수집하는 개인정보의 항목<br>
						회사는 회원가입, 상담, 서비스 신청 등을 위해 아래와 같은 개인정보를 수집하고 있습니다.<br>
						- 회원가입시 : 이름 , 생년월일 , 성별 , 로그인ID , 비밀번호 , 자택 전화번호 , 휴대전화번호 , 이메일 , 14세미만 가입자의 경우 법정대리인의 정보<br>
						- 서비스 신청시 : 주소, 결제 정보<br><br>

						서비스 이용 과정이나 사업 처리 과정에서 서비스이용기록, 접속로그, 쿠키, 접속 IP, 결제 기록, 불량이용 기록이 생성되어 수집됩니다.<br><br>

						나. 수집방법<br>
						- 홈페이지, 서면양식, 게시판, 이메일, 이벤트 응모, 배송요청, 전화, 팩스, 생성 정보 수집 툴을 통한 수집
					</p>
				</div>
			</div>
			
			
		</main>
		<!-- // 내용 -->

<?php
include_once('../outline/footer.php')
?>