<?
/**
* CJ대한통운 택배 OPENDB 관련
* CODE : CJ대한통운 INTERFACE(DB).doc
*/

# 화물상태(CRG_ST)
$crg_stat = array(
	"01" => "집하지시",
	"11" => "집하처리",
	"12" => "미집화",
	"41" => "간선상차",
	"42" => "간선하차",
	"82" => "배송출발",
	"84" => "미배달",
	"91" => "배송완료"
);
# CRG_ST=12 미집화사유(NO_CLDV_RSN_CD)
# CRG_ST=84 미배달사유(NO_CLDV_RSN_CD)
$no_cldv_rsn_code = array(
	12 => array(
		""   => "",
		"49" => "집화이관",
		"02" => "업체미출고",
		"03" => "기집화",
		"01" => "재고부족",
		"06" => "타택배",
		"07" => "천재지변",
		"08" => "주문취소(일반건)",
		"09" => "집배구역불일치",
		"11" => "집화예정",
		"12" => "토요휴무",
		"13" => "취급불가/규격외품",
		"14" => "반품취소/거부",
		"16" => "고객사용중",
		"17" => "지정일회수",
		"18" => "고객부재",
		"21" => "고객정보오류",
		"22" => "교환물건미도착",
		"23" => "회수건없음(업체오류)",
		"25" => "통화안됨(4일이상)",
		"26" => "합포장(미사용)",
		"33" => "시간부족",
		"34" => "차량고장",
		"35" => "포장미비",
		"38" => "도서/외곽지역",
		"44" => "중복예약",
		"48" => "기타2",
		"50" => "보내는분 요청",
		"51" => "받는분 요청"
	),
	84 => array(
		""   => "",
		"01" => "고객정보오류",
		"02" => "고객부재",
		"05" => "지연도착",
		"06" => "분류오류",
		"08" => "통화불가능",
		"09" => "수취거부",
		"11" => "천재지변",
		"16" => "착지변경",
		"21" => "상품사고(파손/분실)",
		"23" => "토요휴무",
		"24" => "지정일배달",
		"32" => "차량고장/사고",
		"33" => "도서/외곽지역",
		"42" => "특판잔류",
		"55" => "결재불가",
		"56" => "배달전취소"
	)
);
# tblorderdelivery_cj columns
$cj_trace_cols = array(
	"serial",
	"cust_id",
	"rcpt_dv",
	"invc_no",
	"cust_use_no",
	"crg_st",
	"scan_ymd",
	"scan_hour",
	"dealt_bran_nm",
	"dealt_bran_tel",
	"dealt_emp_nm",
	"dealt_emp_tel",
	"acptr_nm",
	"no_cldv_rsn_cd",
	"detail_rsn",
	"eai_err_msg",
	"reg_emp_id",
	"reg_dtime",
	"modi_emp_id",
	"modi_dtime"
);
?>