<?php

#정보고시 코드
$jungbo_code = array(
	#의류
	'001'=>array(
		'code'=>'001',
		'title'=>'의류',
		'option'=>array(
			'0'=>'제품 소재',
			'1'=>'색상',
			'2'=>'치수',
			'3'=>'제조자',
			'4'=>'제조국',
			'5'=>'세탁방법 및 취급시 주의사항',
			'6'=>'제조연월',
			'7'=>'품질보증기준',
			'8'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'',
			'3'=>'(주)신원',
			'4'=>'',
			'5'=>'',
			'6'=>'',
			'7'=>'제품 이상 시 공정거래위원회 고시 소비자분쟁해결기준에 의거 보상합니다.',
			'8'=>'(주)신원 1661-2585'
		)
	),
	#구두/신발
	'002'=>array(
		'code'=>'002',
		'title'=>'구두/신발',
		'option'=>array(
			'0'=>'제품 소재',
			'1'=>'색상',
			'2'=>"치수",
			'3'=>'제조자',
			'4'=>'제조국',
			'5'=>'취급시 주의사항',
			'6'=>'품질보증기준',
			'7'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'(운동화인 경우에는 겉감, 안감을 구분하여 표시)',
			'1'=>"발길이: 해외사이즈 표기시 국내사이즈 병행 표기(mm)\n굽높이 (굽 재료를 사용하는 여성화에 한함, cm)",
			'2'=>'',
			'3'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'4'=>'',
			'5'=>'',
			'6'=>'',
			'7'=>''
		)
	),
	#가방
	'003'=>array(
		'code'=>'003',
		'title'=>'가방',
		'option'=>array(
			'0'=>'종류',
			'1'=>'소재',
			'2'=>'색상',
			'3'=>'크기',
			'4'=>'제조자',
			'5'=>'제조국',
			'6'=>'취급시 주의사항',
			'7'=>'품질보증기준',
			'8'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'',
			'3'=>'',
			'4'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'5'=>'',
			'6'=>'',
			'7'=>'',
			'8'=>''
		)
	),
	#패션/잡화 (모자, 벨트, 악세사리)
	'004'=>array(
		'code'=>'004',
		'title'=>'패션/잡화 (모자, 벨트, 악세사리)',
		'option'=>array(
			'0'=>'종류',
			'1'=>'소재',
			'2'=>'치수',
			'3'=>'제조자',
			'4'=>'제조국',
			'5'=>'취급시 주의사항',
			'6'=>'품질보증기준',
			'7'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'',
			'3'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'4'=>'',
			'5'=>'',
			'6'=>'',
			'7'=>''
		)
	),
	#침구류/커튼
	'005'=>array(
		'code'=>'005',
		'title'=>'침구류/커튼',
		'option'=>array(
			'0'=>'제품 소재',
			'1'=>'색상',
			'2'=>'치수',
			'3'=>'제품구성',
			'4'=>'제조자',
			'5'=>'제조국',
			'6'=>'세탁방법 및 취급시 주의사항',
			'7'=>'품질보증기준',
			'8'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'(섬유의 조성 또는 혼용률을 백분율로 표시)',
			'1'=>'',
			'2'=>'',
			'3'=>'',
			'4'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'5'=>'',
			'6'=>'',
			'7'=>''
		)
	),
	#가구(침대/소파/싱크대/DIY제품)
	'006'=>array(
		'code'=>'006',
		'title'=>'가구 ( 침대/소파/싱크대/DIY제품 )',
		'option'=>array(
			'0'=>'품명',
			'1'=>'KC 인증 필 유무',
			'2'=>'색상',
			'3'=>'구성품',
			'4'=>'주요 소재',
			'5'=>"제조자",
			'6'=>"제조국",
			'7'=>'크기',
			'8'=>'배송설치비용',
			'9'=>'품질보증기준',
			'10'=>'A/S 책임자와 전화번호',
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(품질경영 및 공상품안전관리법 상 안전품질표시대상공산품에 한함)',
			'2'=>'',
			'3'=>'',
			'4'=>'',
			'5'=>"수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )\n *구성품 별 제조자가 다른 경우 각 구성품의 제조자,수입자",
			'6'=>'구성품 별 제조국이 다른 경우 각 구성품의 제조국',
			'7'=>'',
			'8'=>'',
			'9'=>'',
			'10'=>''
		)
	),
	#영상가전(TV류)
	'007'=>array(
		'code'=>'007',
		'title'=>'영상가전(TV류)',
		'option'=>array(
			'0'=>'품명 및 모델명',
			'1'=>'전기용품 안전인증 필 유무',
			'2'=>'정격전압, 소비전력, 에너지소비효율등급',
			'3'=>'동일모델의 출시년월',
			'4'=>'제조자',
			'5'=>'제조국',
			'6'=>'크기',
			'7'=>'화면사항',
			'8'=>'품질보증기준',
			'9'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(전기용품안전관리법 상 안전인증대상전기용품, 자율안전확인대상전기용품, 공급자적합성확인대상전기용품에 한함)',
			'2'=>'(에너지이용합리화법 상 의무대상상품에 한함)',
			'3'=>'',
			'4'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'5'=>'',
			'6'=>'(형태포함)',
			'7'=>'(크기, 해상도, 화면비율 등)',
			'8'=>'',
			'9'=>''
		)
	),
	#가정용 전기제품(냉장고 / 세탁기 / 식기세척기 / 전자레인지)
	'008'=>array(
		'code'=>'008',
		'title'=>'가정용 전기제품(냉장고 / 세탁기 / 식기세척기 / 전자레인지)',
		'option'=>array(
			'0'=>'품명 및 모델명',
			'1'=>'전기용품 안전인증 필 유무',
			'2'=>'정격전압, 소비전력, 에너지소비효율등급',
			'3'=>'동일모델의 출시년월',
			'4'=>'제조자',
			'5'=>'제조국',
			'6'=>'크기',
			'7'=>'품질보증기준',
			'8'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(전기용품안전관리법 상 안전인증대상전기용품, 자율안전확인대상전기용품, 공급자적합성확인대상전기용품에 한함)',
			'2'=>'(에너지이용합리화법 상 의무대상상품에 한함)',
			'3'=>'',
			'4'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'5'=>'',
			'6'=>'(용량,형태 포함)',
			'7'=>'',
			'8'=>''
		)
	),
	#계절가전(에어컨 / 온풍기)
	'009'=>array(
		'code'=>'009',
		'title'=>'계절가전(에어컨 / 온풍기)',
		'option'=>array(
			'0'=>'품명 및 모델명',
			'1'=>'전기용품 안전인증 필 유무',
			'2'=>'정격전압, 소비전력, 에너지소비효율등급',
			'3'=>'동일모델의 출시년월',
			'4'=>'제조자',
			'5'=>'제조국',
			'6'=>'크기',
			'7'=>'냉난방면적',
			'8'=>'추가설치비용',
			'9'=>'품질보증기준',
			'10'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(전기용품안전관리법 상 안전인증대상전기용품, 자율안전확인대상전기용품, 공급자적합성확인대상전기용품에 한함)',
			'2'=>'(에너지이용합리화법 상 의무대상상품에 한함)',
			'3'=>'',
			'4'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'5'=>'',
			'6'=>'(형태 및 실외기 포함)',
			'7'=>'',
			'8'=>'',
			'9'=>'',
			'10'=>''
		)
	),
	#사무용기기(컴퓨터 / 노트북 / 프린터)
	'010'=>array(
		'code'=>'010',
		'title'=>'사무용기기(컴퓨터 / 노트북 / 프린터)',
		'option'=>array(
			'0'=>'품명 및 모델명',
			'1'=>'KCC 인증 필 유무',
			'2'=>'정격전압, 소비전력, 에너지소비효율등급',
			'3'=>'동일모델의 출시년월',
			'4'=>'제조자',
			'5'=>'제조국',
			'6'=>'크기, 무게',
			'7'=>'주요 사항',
			'8'=>'품질보증기준',
			'9'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(전파법 상 인증대상상품에 한함, MIC 인증 필 혼용 가능)',
			'2'=>'(에너지이용합리화법 상 의무대상상품에 한함)',
			'3'=>'',
			'4'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'5'=>'',
			'6'=>'(무게는 노트북에 한함)',
			'7'=>'(컴퓨터와 노트북의 경우 성능, 요량, 운영체제 포함여부 등 / 프린터의 경우 인쇄 속도 등)',
			'8'=>'',
			'9'=>''
		)
	),
	#광학기기(디지털카메라 / 캠코더)
	'012'=>array(
		'code'=>'012',
		'title'=>'광학기기(디지털카메라 / 캠코더)',
		'option'=>array(
			'0'=>'품명 및 모델명',
			'1'=>'KCC 인증 필 유무',
			'2'=>'동일모델의 출시년월',
			'3'=>'제조자',
			'4'=>'제조국',
			'5'=>'크기, 무게',
			'6'=>'주요 사항',
			'7'=>'품질보증기준',
			'8'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(전파법 상 인증대상상품에 한함, MIC 인증 필 혼용 가능)',
			'2'=>'',
			'3'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'4'=>'',
			'5'=>'',
			'6'=>'',
			'7'=>'',
			'8'=>''
		)
	),
	#소형전자(MP3 / 전자사전 등)
	'013'=>array(
		'code'=>'013',
		'title'=>'소형전자(MP3 / 전자사전 등)',
		'option'=>array(
			'0'=>'품명 및 모델명',
			'1'=>'KCC 인증 필 유무',
			'2'=>'정격전압, 소비전력',
			'3'=>'동일모델의 출시년월',
			'4'=>'제조자',
			'5'=>'제조국',
			'6'=>'크기, 무게',
			'7'=>'주요 사항',
			'8'=>'품질보증기준',
			'9'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(전파법 상 인증대상상품에 한함, MIC 인증 필 혼용 가능)',
			'2'=>'',
			'3'=>'',
			'4'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'5'=>'',
			'6'=>'',
			'7'=>'',
			'8'=>'',
			'9'=>''
		)
	),
	#주방용품
	'014'=>array(
		'code'=>'014',
		'title'=>'주방용품',
		'option'=>array(
			'0'=>'품명 및 모델명',
			'1'=>'재질',
			'2'=>'구성품',
			'3'=>'크기',
			'4'=>'동일모델의 출시년월',
			'5'=>'제조자',
			'6'=>'제조국',
			'7'=>'식품위생법에 따른 문구',
			'8'=>'품질보증기준',
			'9'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'',
			'3'=>'',
			'4'=>'',
			'5'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'6'=>'',
			'7'=>'식품위생법에 따른 수입 기구 용기의 경우 "식품위생법에 따른 수입신고를 필함"의 문구 ',
			'8'=>'',
			'9'=>''
		)
	),
	#화장품
	'015'=>array(
		'code'=>'015',
		'title'=>'화장품',
		'option'=>array(
			'0'=>'용량 또는 중량',
			'1'=>'제품 주요 사항',
			'2'=>'사용기한 또는 개봉 후 사용기간',
			'3'=>'사용방법',
			'4'=>'제조자 및 제조판매업자',
			'5'=>'제조국',
			'6'=>'주요성분',
			'7'=>'기능성 화장품',
			'8'=>'사용할 때 주의사항',
			'9'=>'품질보증기준',
			'10'=>'소비자상담관련 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(피부타입, 색상(호,번) 등)',
			'2'=>'(개봉 후 사용기간을 기재할 경우에는 제조연월일을 병행표기)',
			'3'=>'',
			'4'=>'',
			'5'=>'(유기농 화장품의 경우 유기농 원료 함량 포함)',
			'6'=>'',
			'7'=>'기능성 화장품의 경우 화장품법에 따른 식품안정청 심사 필 유무 (미백, 주름개선, 자외선차단 등)',
			'8'=>'',
			'9'=>'',
			'10'=>''
		)
	),
	#귀금속 / 보석/ 시계류
	'016'=>array(
		'code'=>'016',
		'title'=>'귀금속 / 보석/ 시계류',
		'option'=>array(
			'0'=>'소재 / 순도 / 밴드재질 (시계의 경우)',
			'1'=>'중량',
			'2'=>'제조자',
			'3'=>'제조국',
			'4'=>'치수',
			'5'=>'착용 시 주의사항',
			'6'=>'주요 사항',
			'7'=>'귀금속, 보석류 - 등급',
			'8'=>'시계 - 기능, 방수 등',
			'9'=>'보증서 제공여부',
			'10'=>'품질보증기준',
			'11'=>'A/S 책임자와 전화전호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'3'=>'(원산지와 가공지 등이 다른경우 함께 표기)',
			'4'=>'',
			'5'=>'',
			'6'=>'',
			'7'=>'',
			'8'=>'',
			'9'=>'',
			'10'=>'',
			'11'=>''
		)
	),
	#식품(농수산물)
	'017'=>array(
		'code'=>'017',
		'title'=>'식품(농수산물)',
		'option'=>array(
			'0'=>'용량(중량), 수량, 크기',
			'1'=>'생산자',
			'2'=>'원산지',
			'3'=>'제조연월일, 유통기한 또는 품질유지기간',
			'4'=>'관련법상 표시사항',
			'5'=>'농산물',
			'6'=>'축산물',
			'7'=>'수산물',
			'8'=>'수입식품',
			'9'=>'상품구성',
			'10'=>'보관방법 또는 취급방법',
			'11'=>'소비자상담 관련 전화번호'
		),
		'comment'=>array(
			'0'=>'포장단위별',
			'1'=>'수입품의 경우 수입자를 함께 표기',
			'2'=>'농수산물의 원산지 표시에 관한 법률에 따른 원산지',
			'3'=>'제조연월일(포장일 또는 생산연도)',
			'4'=>'',
			'5'=>'농산물품질관리법상 유전자변형농산물 표시, 지리적표시',
			'6'=>'축산법에 따른 등급 표시, 쇠고기의 경우 이력관리에 따른 표시 유무',
			'7'=>'수산물품질관리법상 유전자변형수산물 표시, 지리적표시',
			'8'=>'수입식품에 해당하는 경우 "식품위생법에 따른 수입신고를 필함"의 문구 ',
			'9'=>'상품구성',
			'10'=>'',
			'11'=>''
		)
	),
	#가공식품
	'018'=>array(
		'code'=>'018',
		'title'=>'가공식품',
		'option'=>array(
			'0'=>'식품위생법에 따른 표시사항',
			'1'=>'식품의 유형',
			'2'=>'생산자 및 소재지',
			'3'=>'제조연월일, 유통기한 또는 품질유지기한',
			'4'=>'포장단위별 용량(중량), 수량',
			'5'=>'원재료명 및 함량',
			'6'=>'영양성분',
			'7'=>'유전자재조합식품',
			'8'=>'영유야식 또는 체중조절식품 등',
			'9'=>'수입식품',
			'10'=>'소비자상담 관련 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'수입품의 경우 수입자를 함께 표기',
			'3'=>'',
			'4'=>'',
			'5'=>'(농수산물의 원산지 표시에 관한 법률에 따른 원산지 표시 포함)',
			'6'=>'(식품위생법에 따른 영양성분 표시대상 식품에 한함)',
			'7'=>'유전자재조합식품에 해당하는 경우에 표시',
			'8'=>'영유야식 또는 체중조절식품 등에 해당하는 경우 표시광고 사전심의필',
			'9'=>'수입식품에 해당하는 경우 "식품위생법에 따른 수입신고를 필함"의 문구',
			'10'=>''
		)
	),
	#건강기능식품
	'019'=>array(
		'code'=>'019',
		'title'=>'건강기능식품',
		'option'=>array(
			'0'=>'건강기능식품에 관한 법률에 따른 표시사항',
			'1'=>'식품의 유형',
			'2'=>'생산자 및 소재지',
			'3'=>'제조연월일, 유통기한 또는 품질유지기한',
			'4'=>'포장단위별 용량(중량), 수량',
			'5'=>'원재료명 및 함량',
			'6'=>'영양정보',
			'7'=>'기능정보',
			'8'=>'섭취량, 섭취방법 및 섭취 시 주의사항',
			'9'=>'질병의 예방 및 치료를 위한 의약품이 아니라는 내용의 표현',
			'10'=>'유전자재조합식품',
			'11'=>'표시광고 사전심의필',
			'12'=>'수입식품',
			'13'=>'소비자상담 관련 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'수입품의 경우 수입자를 함께 표기',
			'3'=>'',
			'4'=>'',
			'5'=>'(농수산물의 원산지 표시에 관한 법률에 따른 원산지 표시 포함)',
			'6'=>'',
			'7'=>'',
			'8'=>'',
			'9'=>'',
			'10'=>'유전자 재조합식품에 해당하는 경우의 표시',
			'11'=>'',
			'12'=>'수입식품에 해당하는 경우 "건강기능식품에 관한 법률에 따른 수입신고를 필함"의 문구',
			'13'=>''
		)
	),
	#영유아 용품
	'020'=>array(
		'code'=>'020',
		'title'=>'영유아 용품',
		'option'=>array(
			'0'=>'품명 및 모델명',
			'1'=>'KC 인증 필',
			'2'=>'크기, 중량',
			'3'=>'색상',
			'4'=>'재질',
			'5'=>'사용연령',
			'6'=>'동일모델의 출시년월',
			'7'=>'제조자',
			'8'=>'제조국',
			'9'=>'취급방법 및 취급시 주의사항, 안전표시',
			'10'=>'품질보증기준',
			'11'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(품질경영 및 공산품안전관리법 상 안전인증대상 또는 자율안전확인대상 공산품에 한함)',
			'2'=>'',
			'3'=>'',
			'4'=>'(섬유의 경우 혼용률)',
			'5'=>'',
			'6'=>'',
			'7'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'8'=>'',
			'9'=>'(주의, 경고 등)',
			'10'=>'',
			'11'=>''
		)
	),
	#스포츠 용품
	'021'=>array(
		'code'=>'021',
		'title'=>'스포츠 용품',
		'option'=>array(
			'0'=>'품명 및 모델명',
			'1'=>'크기, 중량',
			'2'=>'색상',
			'3'=>'재질',
			'4'=>'제품 구성',
			'5'=>'동일모델의 출시년월',
			'6'=>'제조자',
			'7'=>'제조국',
			'8'=>'상품별 세부 사항',
			'9'=>'품질보증기준',
			'10'=>'A/S 책임자와 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'',
			'3'=>'',
			'4'=>'',
			'5'=>'',
			'6'=>'수입품의 경우 수입자를 함께 표기 (병행수입의 경우 병행수입 여부로 대체가능 )',
			'7'=>'',
			'8'=>'',
			'9'=>'',
			'10'=>''
		)
	),
	#서적
	'022'=>array(
		'code'=>'022',
		'title'=>'서적',
		'option'=>array(
			'0'=>'도서명',
			'1'=>'저자, 출판사',
			'2'=>'크기',
			'3'=>'쪽수',
			'4'=>'제품 구성',
			'5'=>'출간일',
			'6'=>'목차 또는 책소개'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'(전자책의 경우 파일의 용량)',
			'3'=>'(전자책의 경우 제외)',
			'4'=>'(전집 또는 세트일 경우 날권 구성, CD 등)',
			'5'=>'',
			'6'=>''
		)
	),
	#디지털콘텐츠 (음원, 게임, 인터넷강의 등)
	'023'=>array(
		'code'=>'023',
		'title'=>'디지털콘텐츠 (음원, 게임, 인터넷강의 등)',
		'option'=>array(
			'0'=>'제작자 또는 공급자',
			'1'=>'이용조건, 이용기간',
			'2'=>'상품 제공 방식',
			'3'=>'최소 시스템 사양, 필수 소프트웨어',
			'4'=>'청약철회 또는 계약의 해제/헤지에 따른 효과',
			'5'=>'소비자상담 관련 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'(CD, 다운로드, 실시간 스트리밍 등)',
			'3'=>'',
			'4'=>'',
			'5'=>''
		)
	),
	#상품권 / 쿠폰
	'024'=>array(
		'code'=>'024',
		'title'=>'상품권 / 쿠폰',
		'option'=>array(
			'0'=>'발행자',
			'1'=>'유효기간, 이용조건',
			'2'=>'이용 가능 매장',
			'3'=>'잔액 환급 조건',
			'4'=>'소비자상담 관련 전화번호'
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'(유효기간 경과 시 보상 기준, 사용제한품목 및 기간 등)',
			'2'=>'',
			'3'=>'',
			'4'=>''
		)
	),
	#HOTT용
	'025'=>array(
		'code'=>'025',
		'title'=>'INFO',
		'option'=>array(
			'0'=>'소재',
			'1'=>'제조자',
			'2'=>'원산지',
			'3'=>'수입자',
			'4'=>'A/S 담당자 연락처',
			'5'=>'품질보증기준',
			'6'=>'취급시주의사항',
		),
		'comment'=>array(
			'0'=>'',
			'1'=>'',
			'2'=>'',
			'3'=>'',
			'4'=>'',
			'5'=>'',
			'6'=>'',
		)
	),
);

?>